#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details><summary>Show Plan</summary>

```diff

terraform
docker_image.nginx: Refreshing state... [id=sha256:a99a39d070bfd1cb60fe65c45dea3a33764dc00a9546bf8dc46cb5a11b1b50e9nginx:latest]
docker_container.nginx1: Refreshing state... [id=2553ac087209f22e65c3c327805e0df00d650e7c4d9d2b70a9010f3742848ebf]
docker_container.nginx_two: Refreshing state... [id=3a41ef35e5bc41c950f088f6648692972ca5097a85f5e1d52ecdc85a19658e4f]
docker_container.nginx_3: Refreshing state... [id=6e2e2baf4c1fc4cbd9b627063010bf1a07b2f81628f75b1eb018fac3f467c127]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # docker_container.nginx_3 must be replaced
-/+ resource "docker_container" "nginx_3" {
      + bridge            = (known after apply)
      ~ command           = [
          - "nginx",
          - "-g",
          - "daemon off;",
        ] -> (known after apply)
      + container_logs    = (known after apply)
      - cpu_shares        = 0 -> null
      - dns               = [] -> null
      - dns_opts          = [] -> null
      - dns_search        = [] -> null
      ~ entrypoint        = [
          - "/docker-entrypoint.sh",
        ] -> (known after apply)
      ~ env               = [] -> (known after apply)
      + exit_code         = (known after apply)
      ~ gateway           = "172.17.0.1" -> (known after apply)
      - group_add         = [] -> null
      ~ hostname          = "6e2e2baf4c1f" -> (known after apply)
      ~ id                = "6e2e2baf4c1fc4cbd9b627063010bf1a07b2f81628f75b1eb018fac3f467c127" -> (known after apply)
      ~ init              = false -> (known after apply)
      ~ ip_address        = "172.17.0.3" -> (known after apply)
      ~ ip_prefix_length  = 16 -> (known after apply)
      ~ ipc_mode          = "private" -> (known after apply)
      - links             = [] -> null
      ~ log_driver        = "json-file" -> (known after apply)
      - log_opts          = {} -> null
      - max_retry_count   = 0 -> null
      - memory            = 0 -> null
      - memory_swap       = 0 -> null
        name              = "nginx3"
      ~ network_data      = [
          - {
              - gateway                   = "172.17.0.1"
              - global_ipv6_address       = ""
              - global_ipv6_prefix_length = 0
              - ip_address                = "172.17.0.3"
              - ip_prefix_length          = 16
              - ipv6_gateway              = ""
              - network_name              = "bridge"
            },
        ] -> (known after apply)
      - network_mode      = "default" -> null
      - privileged        = false -> null
      - publish_all_ports = false -> null
      ~ runtime           = "runc" -> (known after apply)
      ~ security_opts     = [] -> (known after apply)
      ~ shm_size          = 64 -> (known after apply)
      ~ stop_signal       = "SIGQUIT" -> (known after apply)
      ~ stop_timeout      = 0 -> (known after apply)
      - storage_opts      = {} -> null
      - sysctls           = {} -> null
      - tmpfs             = {} -> null
        # (11 unchanged attributes hidden)

      + healthcheck {
          + interval     = (known after apply)
          + retries      = (known after apply)
          + start_period = (known after apply)
          + test         = (known after apply)
          + timeout      = (known after apply)
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      ~ ports {
          ~ external = 8023 -> 8022 # forces replacement
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ctvedt, Action: `pull_request`*